Repository: xhafan/MrWatchdog
Catalog: src/Core/Resources/Resource.*.resx
Languages: cs

# DeleteScraperConfirmationMessage
source: Really delete this scraper and all related user's watchdogs?
cs: Opravdu chcete smazat tento scraper a všechny související hlídací psy uživatelů?

source: Create scraper
cs: Vytvoř scraper

# FilterResults
source: Optionally enter a search term to filter the results
cs: Volitelně zadejte hledaný výraz pro filtrování výsledků

source: Scrapers
cs: Scrapery

source: Make public
cs: Zveřejnit

source: Manage scrapers
cs: Správa scraperů

source: My watchdogs
cs: Moji hlídací psi

# OnboardingViewAgainStep
source: You can view this help anytime again.
cs: Tuto nápovědu si můžete kdykoli znovu zobrazit.

# WatchdogOnboardingReceiveNotification
source: <p> You can disable email notification about new results. </p> <div class="alert alert-info mb-3"> <i class="fa-solid fa-circle-info"></i> Email notifications about new results are currently free. In the future, free notifications about new results will be available only to a limited number of watchdogs without premium subscription. The premium subscription is not yet implemented. </div>
cs: <p> Můžete deaktivovat emailová oznámení o nových výsledcích. </p> <div class="alert alert-info mb-3"> <i class="fa-solid fa-circle-info"></i> Emailová oznámení o nových výsledcích jsou v současné době zdarma. Bez prémiového předplatného budou v budoucnu bezplatná oznámení o nových výsledcích k dispozici pouze pro omezený počet hlídacích psů. Prémiové předplatné zatím není implementováno. </div>

# ReceiveEmailNotificationAboutNewResults
source: Receive email notification about new scraped results
cs: Dostávejte emailová oznámení o nových výsledcích scrapování

source: Request to make public
cs: Žádost o zveřejnění

source: View scraped results
cs: Zobrazit výsledky scrapování

source: Support
cs: Podpora

source: Logout
cs: Odhlásit

source: Need help?
cs: Potřebujete poradit?

# ContactSupport
source: Need help? Contact support team at
cs: Potřebujete poradit? Kontaktujte tým podpory na

# About
source: <p> A watchdog for any publicly accessible web page. </p> <p> Keep track of changes and get notified by email the moment a page updates or your search term appears. </p> <p> View public {0} or create your own scraper, and create a watchdog. </p>
cs: <p> Hlídací pes pro jakoukoli veřejně přístupnou webovou stránku. </p> <p> Sledujte změny a nechte si zasílat emailová upozornění v okamžiku, kdy dojde k aktualizaci stránky nebo se objeví váš vyhledávaný termín. </p> <p> Prohlédněte si veřejné {0} nebo si vytvořte svůj vlastní scraper, a vytvořte si hlídacího psa. </p>

# AboutScrapers
source: scrapers
cs: scrapery

# LoginOrRegister
source: Log in / register
cs: Přihlásit / zaregistrovat

source: Login with email
cs: Přihlásit emailem

source: Login with Google
cs: Přihlásit přes Google

# RequiredAttribute
source: The {0} field is required.
cs: Pole {0} je povinné.

# LoginOr
source: Or
cs: Nebo

# EmailAddressRegexAttribute
source: The {0} field is not a valid email address
cs: Pole {0} neobsahuje platnou emailovou adresu

# StringLengthAttribute
source: The field {0} must be a string with a maximum length of {1}.
cs: Pole {0} musí být řetězec s maximální délkou {1}.

source: Login link sent
cs: Odkaz pro přihlášení odeslán

# LoginLinkSentDescription
source: <p> A login link has been sent to your email <span class="link-primary">{0}</span> . Check your email, and confirm the login by clicking the login link. </p> <p> Waiting for the confirmation... </p> <p> <small> If you can't find the email, please check your spam folder and mark it as <i>Not Spam</i> to ensure you receive future emails from {1}. </small> </p>
cs: <p> Na vaši emailovou adresu <span class="link-primary">{0}</span> byl odeslán odkaz pro přihlášení. Zkontrolujte svou emailovou schránku a potvrďte přihlášení kliknutím na odkaz pro přihlášení. </p> <p> Čeká se na potvrzení... </p> <p> <small> Pokud email nenajdete, zkontrolujte složku se spamem a označte jej jako <i>Není spam</i>, abyste měli jistotu, že budete dostávat další emaily od {1}. </small> </p>

# YouHaveBeenLoggedIn
source: You've been logged in
cs: Jste přihlášeni

# YouHaveBeenLoggedInDescription
source: <p> You've been logged in on your original session. </p> <p> <b>Close this page</b> and return to your original session. </p>
cs: <p> Jste přihlášeni ve své původní relaci. </p> <p> <b>Zavřete tuto stránku</b> a vraťte se do své původní relace. </p>

source: Copyright
cs: Autorská práva

source: Public scrapers
cs: Veřejné scrapery

# PublicScrapersDescription
source: Browse public scrapers to create a watchdog.
cs: Procházejte veřejné scrapery pro vytvoření hlídacího psa.

source: My scrapers
cs: Moje scrapery

# MyScrapersDescription
source: Browse your scrapers to create a watchdog.
cs: Procházejte scrapery pro vytvoření hlídacího psa.

source: My scraper
cs: Můj scraper

# MyScraperTooltip
source: You created this scraper
cs: Tento scraper jste vytvořili Vy

# PublicStatus
source: Public
cs: Veřejný

# PublicStatusTooltip
source: The scraper is public and discoverable by other users.
cs: Scraper je veřejný a přístupný pro ostatní uživatele.

# RequestedToBeMadePublicStatus
source: Requested to be made public
cs: Požadováno zveřejnění

# RequestedToBeMadePublicStatusTooltip
source: The scraper has been requested to be made public and discoverable by other users.
cs: Byla odeslána žádost, aby byl scraper zveřejněn a byl přístupný pro ostatní uživatele.

# PrivateStatus
source: Private
cs: Soukromý

# PrivateStatusTooltip
source: The scraper is private and not discoverable by other users.
cs: Scraper je soukromý a není přístupný pro ostatní uživatele.

source: Create watchdog
cs: Vytvořit hlídacího psa

source: Log in or register to create watchdog
cs: Přihlaste se nebo se zaregistrujte pro vytvoření hlídacího psa

# ManageScraper
source: Manage
cs: Správa

source: Watched web pages
cs: Sledované webové stránky

source: Scraped results
cs: Výsledky scrapování

# MyWatchdogsDescription
source: Browse your watchdogs.
cs: Procházejte své hlídací psy.

# ManageUserScrapersDescription
source: Manage scrapers created by you.
cs: Spravujte scrapery vytvořené Vámi.

# ManageOtherUsersScrapersDescription
source: Manage scrapers created by other users.
cs: Spravujte scrapery vytvořené jinými uživateli.

# NoScrapedResultsMatchingTheSearchTermAvailable
source: No scraped results matching the search term {0} are currently available.
cs: V současné době nejsou k dispozici žádné výsledky scrapování odpovídající hledanému výrazu {0}.

# NoScrapedResultsAvailable
source: No scraped results are currently available.
cs: V současné době nejsou k dispozici žádné výsledky scrapování.

source: Delete watchdog
cs: Smazat hlídacího psa

# DeleteWatchdogConfirmationMessage
source: Really delete this watchdog?
cs: Opravdu chcete smazat tohoto hlídacího psa?

source: Cancel
cs: Zrušit

source: Save
cs: Uložit

source: Edit
cs: Editovat

# ScraperResultsOnboardingIntro
source: You are on a page showing <b>scraped results</b> of a <b>scraper</b>.
cs: Jste na stránce zobrazující <b>výsledky scrapování scraperu</b>.

# ScraperResultsOnboardingWatchedWebPages
source: This scraper periodically scrapes web page(s) and selects scraped results from them.
cs: Tento scraper pravidelně prochází webové stránky a vybírá z nich výsledky.

# ScraperResultsOnboardingSearchTerm
source: You can enter a search term to filter the scraped results.
cs: Můžete zadat hledaný výraz pro filtrování výsledků scrapování.

# ScraperResultsOnboardingCreateWatchdog
source: Create a watchdog with email notification about new scraped results or new scraped results matching the search term.
cs: Vytvořte hlídacího psa s emailovým upozorněním na nové výsledky scrapování nebo nové výsledky scrapování odpovídající vyhledávanému termínu.

source: Back
cs: Zpět

source: Next
cs: Další

source: Finish
cs: Ukončit

# ScraperResultsOnboardingLoginOrRegisterToCreateWatchdog
source: Log in or register to create a watchdog with email notification about new scraped results or new scraped results matching the search term.
cs: Přihlaste se nebo se zaregistrujte a vytvořte hlídacího psa s emailovým upozorněním na nové výsledky scrapování nebo nové výsledky scrapování odpovídající vyhledávanému termínu.

source: Archived
cs: Archivován

source: Name
cs: Jméno

# ScraperCreateOnboardingSetName
source: Enter the scraper name. In the next step you will define web pages to scrape.
cs: Zadejte název scraperu. V dalším kroku budete definovat webové stránky, které chcete scrapovat.

source: Create
cs: Vytvoř

source: Description
cs: Popis

source: Scraping interval in seconds
cs: Interval scrapování v sekundách

source: Advanced
cs: Pokročilé

source: Number of days between notifications for the same scraped result
cs: Počet dní mezi oznámeními pro stejný výsledek scrapování

# NumberOfFailedScrapingAttemptsBeforeAlerting
source: Number of failed scraping attempts before alerting by email
cs: Počet neúspěšných pokusů o scrapování před zasláním upozornění emailem

# RangeAttribute
source: The {0} must be greater than or equal to {1}
cs: {0} musí být větší nebo rovno {1}

source: Delete scraper
cs: Smazat scraper

source: Add web page to scrape
cs: Přidat webovou stránku na scrapování

source: The web page has been automatically disabled.
cs: Webová stránka byla automaticky deaktivována.

source: To enable it make sure the web page is successfully scraped.
cs: Chcete-li ji povolit, ujistěte se, že webová stránka byla úspěšně scrapována.

source: Enable web page
cs: Povolit webovou stránku

# PleaseEnableItOnceYourEditsAreComplete
source: Please enable it once your edits are complete so that watchdogs can continue watching it.
cs: Po dokončení úprav ji prosím povolte, aby ji mohli hládací psi nadále sledovat.

# MakeScraperPublicConfirmationMessage
source: Really make the scraper public and discoverable by other users?
cs: Opravdu zveřejnit scraper a zpřístupnit jej ostatním uživatelům?

# RequestToMakeScraperPublicConfirmationMessage
source: Really request to make the scraper public and discoverable by other users?
cs: Opravdu odeslat žádost, aby byl scraper veřejný a přístupný pro ostatní uživatele?

# MakeScraperPrivateConfirmationMessage
source: Really make the scraper private and non-discoverable by other users?
cs: Opravdu nastavit scraper jako soukromý a nepřístupný pro ostatní uživatele?

source: Make private
cs: Nastavit jako soukromý

source: Delete web page
cs: Smazat webovou stránku

# UrlAttribute
source: The {0} field is not a valid http or https web address.
cs: Pole {0} není platná http nebo https webová adresa.

# Selector
source: CSS selector
cs: CSS selektor

source: Select text instead of HTML
cs: Vyberte text místo HTML

# HttpHeaders
source: HTTP headers (one per line; format: "header name: value")
cs: HTTP hlavičky (jedna na řádek; formát: "název hlavičky: hodnota")

source: Scrape web page
cs: Scrapovat webovou stránku

source: Web page not scraped yet
cs: Webová stránka ještě nebyla scrapována

source: Scraped on
cs: Scrapováno

source: Author
cs: Autor

source: Calculated earnings for this month
cs: Vypočítané výdělky za tento měsíc

# ScraperEarningsCalculationInfo
source: The scraper earnings calculation will be based on the number of premium users having a watchdog for this scraper. The premium subscription is not yet implemented.
cs: Výpočet výdělků scraperu bude založen na počtu prémiových uživatelů, kteří mají pro tento scraper hlídacího psa. Prémiové předplatné zatím není implementováno.

# NumberOfUsersWithWatchdogWithEmailNotification
source: Number of users with a watchdog with email notification
cs: Počet uživatelů s hlídacím psem s emailovým upozorněním

# NumberOfUsersWithWatchdogWithoutEmailNotification
source: Number of users with a watchdog without email notification
cs: Počet uživatelů s hlídacím psem bez emailového upozornění

source: Error
cs: Chyba

# ErrorDescription
source: An error occurred while processing your request.
cs: Při zpracování vašeho požadavku došlo k chybě.

source: Request ID
cs: Id požadavku

source: Navigate to the
cs: Přejděte na

source: home page
cs: domovskou stránku

source: Status code
cs: Stavový kód

source: Error message
cs: Chybová zpráva

source: Access denied
cs: Přístup odepřen

# RemoveWebPageConfirmationMessage
source: Really remove the web page?
cs: Opravdu odstranit webovou stránku?

# InvalidHttpHeaderFormatErrorTemplate
source: Invalid HTTP header format: "{0}". Expected format is "header name: value".
cs: Neplatný HTTP formát hlavičky: "{0}“. Očekávaný formát je "název hlavičky: hodnota“.

# ScraperDetailOnboardingIntro
source: You navigated to a <b>scraper</b> management.<br/><br/>This scraper will scrape web pages and will select results based on the CSS selector.
cs: Jste na stánce pro <b>správu</b> scraperu.<br/><br/>Tento scraper bude scrapovat webové stránky a vybírat výsledky na základě CSS selektoru.

# ScraperDetailOnboardingAddWebPage
source: Add a web page this scraper will scrape.
cs: Přidejte webovou stránku pro scrapování.

# ScraperDetailOnboardingScrapingInterval
source: You can change the scraping interval.
cs: Můžete změnit interval scrapování.

# ScraperDetailOnboardingViewScrapedResults
source: View scraped results to be able to create a watchdog with an email notification about new scraped results.
cs: Zobrazte výsledky scrapování, abyste si mohli vytvořit hlídacího psa s emailovým upozorněním na nové výsledky scrapování.

# ScraperDetailOnboardingRequestToMakePublic
source: Request to make the scraper public and discoverable by other users who will then be able to create a watchdog with email notification about its new scraped results.
cs: Pošlete žádost o zveřejnění scraperu a jeho zpřístupnění ostatním uživatelům, kteří si pak budou moci vytvořit hlídacího psa s emailovým upozorněním na nové výsledky scrapování.

# ThereAreNoPublicScrapers
source: There are no public scrapers. You can create a scraper {0} and later make it public.
cs: Ještě neexistují žádné veřejné scrapery.

source: here
cs: zde

# WatchdogOnboardingIntro
source: You navigated to your <b>watchdog</b>.<br/> <br/> This watchdog emails you notification about new results of the related scraper.
cs: Jste na stránce svého <b>hlídacího psa</b>.<br/> <br/> Tento hlídací pes Vám zasílá emailem upozornění na nové výsledky daného scraperu.

# WatchdogOnboardingIntroScrapedResults
source: It periodically watches related scraper results.
cs: Pravidelně sleduje výsledky souvisejícího scraperu.

# WatchdogOnboardingIntroSearchTerm
source: You can enter a search term to filter the results. When no results, or no results matching the search term are currently available, you will receive an email notification as soon as they are available.
cs: Můžete zadat hledaný výraz pro filtrovnání výsledků. Pokud v současné době nejsou k dispozici žádné výsledky, nebo žádné výsledky odpovídající hledanému výrazu, obdržíte emailové oznámení jakmile budou k dispozici.

source: You have no watchdogs.
cs: Nemáte žádné hlídací psy.

# ListOfScrapers
source: scrapers
cs: scraperů

# YouHaveNoScrapersCreated
source: You have no scrapers created. You can create a scraper {0}.
cs: Nemáte vytvořené žádné scrapery. Scraper můžete vytvořit {0}.

# AddNewWatchdogRecommendation
source: To add a new watchdog, go to the list of {0}, select one, and choose <i>{1}</i>.
cs: Chcete-li přidat nového hlídacího psa, přejděte do seznamu {0}, vyberte nějaký a zvolte <i>{1}</i>.

# ScrapeHtmlAsRenderedByBrowser
source: Scrape HTML as rendered by a browser
cs: Scrapovat HTML tak jak je renderováno prohlížečem

# ScrapingByBrowserWaitFor
source: Wait for
cs: Počkat na

# ScrapingByBrowserWaitForDomContentLoaded
source: HTML loaded; images and CSS not loaded
cs: Načtení HTML; obrázky a CSS nejsou načteny

# ScrapingByBrowserWaitForNetworkIdle
source: HTML, images and CSS loaded; no network activity for 0.5 seconds; highest chance of all scripts to complete
cs: Načtení HTML, obrázků a CSS; žádná síťová aktivita po dobu 0,5 sekundy; nejvyšší šance na dokončení všech skriptů

# ScrapingByBrowserWaitForLoad
source: HTML, images and CSS loaded
cs: Načtení HTML, obrázků a CSS
